Revit 2027 API
PostPattern.CornerPost Property
 Accesses the object containing properties related to the corner post.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BalusterInfo CornerPost { get; }
Public ReadOnly Property CornerPost As BalusterInfo
	Get
public:
property BalusterInfo^ CornerPost {
	BalusterInfo^ get ();
}
member CornerPost : BalusterInfo with get
Property Value
BalusterInfo
See Also
Reference
PostPattern Class
Autodesk.Revit.DB.Architecture Namespace